zhujoe/esp8266/src/main.cpp
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Setting");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 120);
  u8g2.sendBuffer();

  if (serverflg == 0)
  {
    MDNS.begin(mDNSname);
    mcuserver.on("/", serverHomePage);
    mcuserver.begin();
    serverflg = 1;
  }
}

// void ICACHE_FLASH_ATTR light_sleep()
// {
//   wifi_station_disconnect();
//   wifi_set_opmode_current(NULL_MODE);
//   wifi_fpm_set_sleep_type(LIGHT_SLEEP_T);
//   wifi_fpm_open();
//   gpio_pin_wakeup_enable(GPIO_ID_PIN(5), GPIO_PIN_INTR_LOLEVEL);
//   wifi_fpm_do_sleep(0xFFFFFFF);
//   u8g2.setPowerSave(1);
// }

Menu menu[21] = {
    //---------time-----------
    {0, 18, 4, 1, 0, timePage},
    {1, 3, 2, 1, 0, countDownPage},
    {2, 1, 3, 2, 0, datePage},
    {3, 2, 1, 3, 0, lifePage},
    //---------server----------
    {4, 0, 17, 5, 4, serverPage},
    {5, 11, 6, 5, 4, totalityPage},
    {6, 5, 7, 6, 4, cpuPage},
    {7, 6, 8, 7, 4, diskPage},
    {8, 7, 9, 8, 4, memoryPage},
    {9, 8, 10, 9, 4, networkPage},
    {10, 9, 11, 10, 4, uptimePage},
    //-------server_control-------
    {11, 10, 5, 12, 4, controlPage},
    {12, 16, 14, 13, 11, rebootPage},
    {13, 13, 13, 13, 13, doreboot},
    {14, 12, 16, 15, 11, shutdownPage},
    {15, 15, 15, 15, 15, doshutdown},
    {16, 14, 12, 16, 11, volumePage},
    //---------note----------
    {17, 4, 18, 17, 17, notePage},
    //--------setting----------
    {18, 17, 0, 19, 18, settingPage},
    {19, 19, 19, 19, 18, doSettingPage},
    //--------other status-----
    {20, 20, 20, 20, 20, noMessagesPage},

};
void (*operation_index)();
int func_index = 0;
// int stack_func_index = 0;

void setup()
{
  Serial.begin(115200);
  pinMode(onboardledPin, OUTPUT);
  digitalWrite(onboardledPin, LOW);

  EEPROM.begin(1024);
  u8g2.begin();

  Serial.println(EEPROM.read(EEPROM_INITADDR));
  Serial.println(EEPROM.read(EEPROM_SETUPNUMADDR));

  if (EEPROM.read(EEPROM_INITADDR) != 1)
  {
    initdev();
  }
  else
  {
    restWifiConfig();
  }

  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_open_iconic_all_6x_t);
  u8g2.drawGlyph(40, 48, 97);
  u8g2.drawRFrame(30, 54, 68, 6, 2);
  u8g2.sendBuffer();

  pinMode(enterKey, INPUT_PULLUP);
  pinMode(backKey, INPUT_PULLUP);
  pinMode(rightKey, INPUT_PULLUP);
  pinMode(leftKey, INPUT_PULLUP);

  u8g2.setFont(u8g2_font_baby_tf);
  u8g2.setFontDirection(1);

  randomSeed(micros()); //
  u8g2.drawRBox(30, 54, 10, 6, 2);
  u8g2.drawStr(0, 0, "wifi");
  u8g2.sendBuffer();

  if (wifisetupflg)
  {
    wifi_setup(); //
    u8g2.drawRBox(30, 54, 20, 6, 2);
    u8g2.setDrawColor(0);
    u8g2.drawBox(0, 0, 6, 60);
    u8g2.setDrawColor(1);
    u8g2.drawStr(0, 0, "client_set");
    u8g2.sendBuffer();
  }

  client.setServer(mqtt_server, 1883); //
  client.setCallback(mqttCallback);    //
  u8g2.drawRBox(30, 54, 40, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "time_set");
  u8g2.sendBuffer();

  timeClient.begin(); //
  u8g2.drawRBox(30, 54, 48, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "time_update");
  u8g2.sendBuffer();

  timeClient.update(); //
  u8g2.drawRBox(30, 54, 56, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "mqtt");
  u8g2.sendBuffer();

  mqtt_reconnect(); //
  client.loop();    //
  u8g2.drawRBox(30, 54, 63, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "ready");
  u8g2.sendBuffer();

  u8g2.drawRBox(30, 54, 68, 6, 2);
  u8g2.sendBuffer();
  recmessagetime = timeClient.getEpochTime();
  u8g2.setFontDirection(0);
}

void loop()
{
  while (WiFi.status() != WL_CONNECTED)
  {
    wifiErrPage();
    delay(500);
  }

  if (!client.connected())
  {
    noMessagesPage();
    mqtt_reconnect();
  }
  client.loop();

  if (serverflg)
  {
    mcuserver.handleClient();
  }

  enterVal = digitalRead(enterKey);
  backVal = digitalRead(backKey);
  leftVal = digitalRead(leftKey);
  rightVal = digitalRead(rightKey);

  nomessagesflag = 0;
  timenowEpoch = timeClient.getEpochTime();
  if (timenowEpoch - recmessagetime > intervalmessagetime)
  {
    nomessagesflag = 1;
  }

  if ((enterVal == LOW) || (backVal == LOW) || (leftVal == LOW) || (rightVal == LOW))
  {
    delay(5);
    if (enterVal == LOW)
    {
      while (!enterVal)
      {
        enterVal = digitalRead(enterKey);
        operation_index = menu[func_index].callback;
        (*operation_index)();
      }
      func_index = menu[func_index].enter;
    }
    if (backVal == LOW)
    {
      while (!backVal)
      {
        backVal = digitalRead(backKey);
        operation_index = menu[func_index].callback;
        (*operation_index)();
      }
      func_index = menu[func_index].back;
    }
    if (leftVal == LOW)
    {
      while (!leftVal)
      {
        leftVal = digitalRead(leftKey);
        operation_index = menu[func_index].callback;
        (*operation_index)();
      }
      func_index = menu[func_index].left;
    }
    if (rightVal == LOW)
    {
      while (!rightVal)
      {
        rightVal = digitalRead(rightKey);
        operation_index = menu[func_index].callback;
        (*operation_index)();
      }
      func_index = menu[func_index].right;
    }
  }

  operation_index = menu[func_index].callback;
  (*operation_index)();
}